Tekla Open API Reference for Tekla Structures 2025
MarkSetAttributes Methods
The MarkSet.MarkSetAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file. Not implemented yet.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
MarkSet.MarkSetAttributes Class
Tekla.Structures.Drawing Namespace